post/2023-06-02-capture-001.org
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+macro: kbd @@html:<kbd>$1</kbd>@@

#+title: capture-001
#+date: 2023-06-02 Jun 16:42
#+math: true
#+hugo_tags: computation
#+hugo_categories: blog
#+hugo_custom_front_matter: :license ""


* Prelude
** Jargon
*** TODO Predicates
*** TODO Quantifiers
*** Alphabet
- An alphabet is simply some finite non-empty set $A$ of objets called symbols.
**** Words/Strings
- An n-tuple of symbols of $A$ is called a word or a string on $A$.
***** Properties of Words/Strings
Let $u,v \in A^*$,
- Concatenation: If $u=\text{bab}$ and $v=\text{abc}$ then $u \cdot v = \text{bababc}$.
*** Languages
- The set of all words on the alphabet $A$ is written as $A^*$ and any subset of $A^*$ is called a language on $A$.
*** Residues
- Consider a language $L = \{x \ | \ w.x \in L\}$ i.e string "$w$" is in the
  language iff it is followed by $x$ i.e $x$ leads to acceptance of $w$ so $x$
  here is called the *residue* which is also written as $L_/_w$ .
** Set Theory
- A set is a collection into a whole of some well recognized objects i.e the set's elements.
- As collections \equiv whole \equiv set implies that the definition is circular.
- So, the definition of set is based on a collective faith or some kind of intuition among humans.
*** Properties of sets
**** Equality
- Two sets are equal iff they have the exact same elements.
- This is also called the principle of extensionality which implies that a finite set can be defined by means of their elements.
- Another way to describe a set is by using the shared property of its elements ex. $\{x \ | \ \text{some property of x}\}$.
**** Relations
***** Subset
- We write $R \subseteq S$ and say that $R$ is a subset of $S$ which means that every element of $R$ is in $S$.
- Thus, $R = S$ iff $R \subseteq S$ and $S \subseteq R$.
- For any set $\phi \subseteq R$ and $R \subseteq R$.
****** Proper Subset
- When $R \subseteq S$ but $R \neq S$ then we say $R$ is a proper subset of $S$ and write it as $R \subset S$.
**** Powerset
- If $A$ is a set then the set $\mathbb{P}$ such that $\mathbb{P} = \{B \ | \ B \subseteq A\}$ is called the powerset of
  $A$ i.e the set of all subsets of $A$.
*** Operations on sets
**** Union
- $R \cup S$ is the collection of all objects which are members of either $R$ or $S$ or both.
**** Intersection
- $R \cap S$ is the collection of all objects which belong to both $R$ and $S$.
**** Difference
- $R-S$ is the collection of all objects which belong to $R$ but not $S$.
- Thus, $R-S = R - (R \cap S)$.
**** De-Morgan's Identities
- $\bar{R \cup S} = \bar{R} \cap \bar{S}$
- $\bar{R \cap S} = \bar{R} \cup \bar{S}$
*** Diagonalization
*** Russels Paradox
- The best definition in my opinion is from Stanford Encyclopedia of Philosophy,
  - "Russell’s paradox is the most famous of the logical or set-theoretical paradoxes. Also known as the Russell-Zermelo
    paradox, the paradox arises within naive set theory by considering the set of all sets that are not members of
    themselves. Such a set appears to be a member of itself if and only if it is not a member of itself. Hence the paradox. "
- To put it more formally, as I said that we can define a set by means of some shared property of its elements. Let the
  property be, $\phi(x)$ which is $x \in x$ then, a set $R = \{x \ | \ \neg\phi(x)\}$ is the set whose members are exactly those
  objects that are not members of themselves. The paradox is whether $R \in R$ or $R \notin R$.
- In Russel's own words,
  "The comprehensive class we are considering, which is to embrace everything, must embrace itself as one of its
  members. In other words, if there is such a thing as “everything,” then, “everything” is something, and is a member of the
  class “everything.” But normally a class is not a member of itself. Mankind, for example, is not a man. Form now the
  assemblage of all classes which are not members of themselves. This is a class: is it a member of itself or not? If it
  is, it is one of those classes that are not members of themselves, i.e., it is not a member of itself. If it is not,
  it is not one of those classes that are not members of themselves, i.e. it is a member of itself. Thus of the two
  hypotheses – that it is, and that it is not, a member of itself – each implies its contradictory. This is a
  contradiction."
**** Fix
We can fix this paradox by using Zermelo's separation principle which solves the paradox by taking any consistent set
$S$ and a $\phi(x)$ with free $x$, then there will be a set $\{x \in S \ | \ \phi(x)\}$. Now even if $\phi(x)$ is $x \notin x$ the
corresponding set will not be contradictory since it consists only of those members found within S that are not members of themselves. Hence the set fails to include itself.
**** TODO Implications
** Relations
*** Binary Relation
- A binary relation $R \subseteq A \times B$ is construed as a *process* of taking elements from $A$ and yields elements in $B$.
*** Properties of Relations
Let $R \subseteq A \times A$ i.e a binary relation from $A$ to $A$,
- Symmetric: $xRy \implies yRx$
- Transitive: $(xRy \ \& \ yRz) \implies xRz$
- Reflexive: $xRx \ \forall x \in A$
** Mappings
- A mapping is defined as a triplet $(A,R,B)$ where $R \subseteq A \times B$ we write $R: \ A \implies B$ as a mapping where
  $A$ is the domain and $B$ is the range.
*** Operations on Mappings
- Inverse: If $R: \ A \implies B$ then,  $R^{-1}: \ B \implies A$ is its inverse is defined as $xRy$ iff $yR^{-1}x$.
- Composition: If $R:\ A \implies B$ and $Q:\ B \implies C$ then $(R;Q): \ A \implies C$ is defined as $x(R;Q)z$ iff
  $xRy$ and $yRz$ for some $y \in B$.
*** Properties of Mappings
Let $R:\ A \implies B$ then,
- Univalent (Single Valued): $\forall x \in A$ there is *at-most one* $y\in B$ such that $xRy$.
- Injective (Single Sourced): $\forall y \in B$ there is *at-most one* $x \in A$ such that $xRy$.
- Total: $\forall x \in A$ there is *at-least one* $y \in B$ such that $xRy$.
- Surjective: $\forall y \in B$ there is *at-least one* $x \in A$ such that $xRy$.
If all three properties are valid for some relation then it is called an equivalence relation.
** Functions
- A function is a set $f$ all of whose members are ordered pairs and that has property, $(a,b) \in f \ \text{and} \ (a,c)
  \in f \ \text{implies} \ b = c$.
- Intuitively it's better to think of the pairs as the row of a table. For function $f$ one writes $f(a)=b$ to mean that
  $(a,b) \in f$ and the definition ensures that for each $a$ there can only be one $b$.
- The set of all $a$'s such that $(a,b) \in f$ is called the domain of $f$ and set of all $f(a)$ is called its range.
- $\phi$ is also a function considered on some set $S$ but it's just nowhere defined.
*** Partial Function
- A partial function on set $S$ is a function whose domain is a subset of $S$ that means its defined for some elements
  of $S$ but not for all elements.
- If $R: \ A \implies B$ is single valued we say that it is a partial function from $A$ to $B$ and write it as $R: \ A
  \rightharpoonup B$.
