post/2023-06-02-capture-001.org
*** Total Function
- If a partial function on $S$ has the domain $S$ then its called a total function i.e its defined for all elements of $S$.
- If $R: \ A \implies B$ is single valued and total we say that it is a total function from $A$ to $B$ and write it as $R: \ A
  \rightarrow B$.
*** Injective Functions
- We say that $A \preccurlyeq B$ iff there exists an injection $E: \ A \rightarrow B$ where $A$ is size bounded by $B$ and the injection
  preserves size and $E$ is the size embedding of $A$ in $B$.
- Thus, instead of counting all elements of set to determine equivalence of sets we can say that $A \equiv B$ when $A \preccurlyeq B$
  and $B \preccurlyeq A$.
*** Bijections
- If a function $f: \ A \rightarrow B$ is both injective and surjective then it's called a bijection and write it as $A \cong B$.
- $f$ draws a one to one correspondence between elements of $A$ and $B$.
- Bijective functions are closed under inverse and composition.
** Induction
- It is a technique for proving statements of form $(\forall n)P(n)$ where $P$ is a predicate on $\mathbb{N}$. The process is
  as follows,
  + First we prove for auxiliary statement i.e $P(0)$. This is called the base step.
  + And then for $(\forall n)(\text{if} \ P(n) \ \text{then} \ P(n+1))$. For this we fix some arbitrary value for $n$ and call
    it $k$ then we *assume* $P(k)$ and prove $P(k+1)$. Here $P(k)$ is called the induction hypothesis and the step is
    called the induction step or generative step.
- Once the above statements are proved the original statement $(\forall n)P(n)$ is also proved as,
  - If $P(0)$ then $P(1)$,
  - If $P(1)$ then $P(2)$,
  - If $P(2)$ then $P(3)$ $\cdots$
- This might seem paradoxical as we are assuming $P(k)$ to be true which is what one is supposed to be proving but as
  $k$ is just some arbitrary $n$ and we are not assuming our original statement which we set out to prove i.e $(\forall
  n)P(n)$ it is not infact paradoxical.
** Mathematical Machines
- They are basically data handlers. It deals with discrete (individually separated) and finite data.
- The data is most of the times textual data.
- The computation terminates only after the end of input is reached.
*** Finite Automata
- A finite automata $M$ in the alphabet $A = \{s_1, s_2, \cdots, s_n\}$ with states $Q = \{q_1, q_2, \cdots, q_m\}$ is given by a
  function $\delta$ that maps each pair $(q_1, s_1)$ where $1 \le i \le m$, $1 \le j \le n$ into a state $q_k$ together with a set $F
  \subseteq Q$. One of the states usually $q_1$ is singled out and called the initial state. The states in $F$ are
  called final or accepting states and $\delta$ is called the transition function.
- The automata in above definition is also called a *DFA*.
**** Important Theorems
**** Clipping Property
"*If* $M$ is a $k$ state automaton over $\Sigma^*$ and $w\in\Sigma^*$ is accepted by $M$ and
$u$ is a substring of $w$ of length $\ge k$ *then* there exists a substring $y$ of
$u$ such that removing $y$ yields a $w^'$ which is still in $\Sigma^*$ and is
accepted by $M$"
- Property of all regular languages.
**** NFA
- It is same as *DFA* except that the $\delta$ is the set of states instead of a member of $Q$.
- An NDFA over alphabet $A$ and set of states $Q$ which is specified by giving a transition function $\delta$ which maos each
  pair $(q_i, s_j)$ into a possibly empty subset of $Q$ and a fixed subset $F \subseteq Q$,
  - $\delta^*(q_i, 0) = \{q_i\}$
  - $\delta^*(q_i, us_j) = \cup_{q \in \delta^*(q_u, u)} \delta(q, s_j)$
- Here, $\delta^*$ accumulates all states that the NFA can enter when it reaches the right end of $u$ beginning from the left
  end of $u$ in state $q_1$ and $u$ is accepted iff $\delta^*(q_1, u) \cap F \neq \phi$.
** Basic Languages
- Basic languages over $\Sigma$ are constructed with set operations of union, intersection, difference, kleene star, kleene plus from
  finite languages over $\Sigma$.
- That is to say,
  + Finite languages are basic.
  + If $L$ and $M$ are basic then so are $L \cup M$, $L \cap M$, $L - M$, $L^*$, $L^+$, $L.M$.
** Regular Languages
- A language is called regular if there is a finite automata that accepts it.
- Similar to basic languages except that for generation we only use union and as language operation we only use
  concatenation, kleene star.
*** Regular Expressions
- Regex is just a notation for regular languages.
*** Closure Properties
- If $L$ and $\bar{L}$ are regular languages then so is $L \cup \bar{L}$.
- If $L_1$ and $L_2$ are regular languages then so is $L_1 \cap L_2$.
- If $L \subseteq A^*$ is a regular language then so is $\bar{L}$ i.e $A^* - L$.
- $\phi$ and $\epsilon$ are regular languages.
*** Kleene's Theorem
A language is regular iff it can be obtained from a finite languages by applying the three operations $\cup, \cap, \star$ a finite
number of times.
** Symbolic Computing
- In symbolic computing there are no states.
- The rewrite rules act as the operational engine analogous to transition functions.
- Rewrite systems use auxiliary symbols dubbed non terminals to indicate computation's type of action and location.
- A rewrite system that generates a language is called a grammar.
- A grammar consists of,
  + $\Sigma$ the alphabet.
  + $N$ the set of non terminals.
  + $S$ the initial non terminal.
  + $R$ the set of rewrite rules.
*** CFG
- It is a grammar where every source in a rewrite rule is a non terminal.
- Languages produced by such a grammar are called context-free languages.
**** Closure Properties of CFL
Here both $L$ and $L'$are CFLs.
- $L\cup L'$ is a CFL as $S \rightarrow S_1 \ | \ S_2$
- $L\cdot L'$ is a CFL as $S \rightarrow S_1 \cdot S_2$
- $L^*$ is a CFL as $S \rightarrow S_1\cdot S$
**** Other Properties
- All regular languages are context-free but not all context free languages regular.
- Compliment of CFG may not be a CFG.
- $\text{CFL} \cap \text{RL} = \text{CFL}$
- $\text{CFL} - \text{RL} = \text{CFL}$
- $\text{RL} - \text{CFL} \neq \text{CFL}$
- $\text{CFL} - \text{CFL} \neq \text{CFL}$
**** Dual Clipping Theorem for CFLs
- Let $G$ be a CFG over $\Sigma$ with $m$ non terminals and all productions of degree $\le d$.
- If $w \in L(G)$ has length $\ge k$ where $k = d^m$ then,
  + $w$ has a sub-string $p$ of length $\le k$ with disjoint sub strings $y_0 \ \& \ y_1$ both non empty such that
    removing them from $w$ yields a $w'$ such that $w^{'} \in L(G)$.
*** Context Freedom Lemma
- As a descendant of one non terminal is different from descendent of another,
  $G = (\Sigma, N, S, R) \ \& \ \Gamma = \Sigma \cup N$ then if $u_0, u_1 \in \Gamma^*$ and $u_0\cdot u_1 \rightarrow^* y$ then $v = v_0 \cdot v_1$ such that $u_0
  \rightarrow^* v_0$ and $u_1 \rightarrow^* v_1$.
*** PDA
** More General Machines
*** 2DFA
*** LBA
* Parts of the story
** Models of Computations
- Turing machines
- lambda calculus
- cellular automata,
- pointer machines,
- bouncing billiards balls,
- Conway’s Game of life
