post/2023-06-02-capture-001.org
*** Why are all these models equivalent?
- All models of computation are considered to be equivalent because they are all able to simulate each other with a polynomial time overhead. This means that any computation that can be performed by one model of computation can also be performed by another model of computation, albeit with a possibly longer running time.
The notion of equivalence among models of computation is based on the Church-Turing thesis, which states that all effective computations can be performed by a simple theoretical machine known as a Turing machine. This thesis implies that all models of computation that can simulate a Turing machine are equivalent in terms of their computational power.
There are many different models of computation, including the Turing machine, the Lambda calculus, and the Random access machine (RAM). These models are all considered to be equivalent because they can all simulate each other with a polynomial time overhead. This means that any computation that can be performed by one model of computation can also be performed by another model of computation, albeit possibly with a longer running time.
** Church-Turing Thesis
- The notion of "computability" is completely captured by Turing machines.
- Here "thesis" means a declaration of faith as no rigorous proof is possible due to circular reasoning. So, this thesis can never be definitively confirmed.
*** Evidence
- As information is based on discrete and unambiguous representation and can be therefore be given by discrete and recognized symbols laid out in space.
- Such layouts can be reduced to a 1-D layout as a discrete space can be specified by addresses.
- So, computation is indeed a discrete process as any computing device has discrete states and a finite state of transition rule.
- The device navigates through data and access it, modifies it.
** Scope of computing
*** Jargon
**** Decision Problems
- A decision problem is a request for an algorithm.
**** Instances
- Finite discrete objects which can be represented textually.
**** Solution
- An algorithm for deciding each instance whether it satisfies the property. If it satisfies then the problem is decidable else undecidable.
**** Semantics
- A program is a piece of text, its meaning is called semantics.
**** Semi-decidable or T-recognizable
- A problem is semi-decidable iff it is recognized (as a language) by a Turing acceptor.
***** Certificates
- Many decision problems are of for "There is for instance $X$ an object $c$ such that ..." here $c$ is a certificate for $x \in \mathcal{P}$.
- A certification for problem $P$ is a binary relation $\vdash_{P}$ between instances of $X$ of $P$ and string $c$ such that for every instance $X$: $X \in P$ iff $c \vdash X$ for some $c$.
- The relation $\vdash_{P}$ is a certificate for $P$ when $c \vdash_{P} X$ certifies that $X \in P$.
- Checking that a certificate $c$ for $X$ is a good one i.e $c \vdash X$ must be computationally easier than deciding $X$ without extra help.
- Ex. verification of some valid answer for an semi-decidable problem is easier than finding one. It is easier to check whether some $c$ divides $n$ than answering whether $n$ is composite.
***** Decidable Certification
- A certification $\vdash$ is of a problem $P$ is decidable if it is decidable as a set i.e there is an algorithm for deciding whether given $c$ and $X$ is $c \vdash X$.
***** TODO Semi-Decidable Certification
**** Computably Enumerated
- A problem $L \subseteq \Sigma^*$ is CE if there is a function $f: \mathbb{N} \rightarrow \Sigma^*$ with image $L$ i.e $L$ is the set of all output values that $f$ may produce.
**** Orderly Enumerated
- A language $L \subseteq \Sigma^*$ is OE if there is a computable injection $f: \mathbb{N} \rightarrow \Sigma^*$ with $|f(n)| \le |f(n+1)|$ whose image is $L$.
**** Computable Function
- A function $\rho:\ \Sigma^* \rightarrow \Sigma^*$ is computable if there is a TM $F$ such that $F$ on input $w$ halts with $\rho(w)$ on its tape for all $w \in \Sigma^*$.
**** Reductions
- How do we compare two decision problems? To answer this question we first see how we compare two sets.
  - $A \preccurlyeq B$ if there is an injection $f: \ A \rightarrow B$ . So, we compare using $f$ as a way to construe $A$ as a part of $B$ as $f$ is a special function that preserves size.
  - If there is a way to transform an algorithm solving $P$ into an algorithm solving $Q$ then, $P \preccurlyeq Q$.
***** What is it exactly?
- A reduction of a decision problem $P$ to problem $Q$ is a function,
  - $\rho : \ \text{Instances of P} \rightarrow \text{Instances of Q}$
    - s.t for every instance $X$ of $P$, $X \in P$ iff $\rho(X) \in Q$. Then we can write $\rho \ : P \preccurlyeq Q$
      | A: decidable   | B: $\perp$         |
      | A: undecidable | B: undecidable |
      | B: undecidable | A: $\perp$         |
      | B: decidable   | A: decidable   |
**** Trivial Property
- A property is trivial for a language $L$ if it is true of every $w \in L$ or
  true for none.
**** Denotational/stable Properties
- The denotation of a syntactic phrase is its dictionary meaning.
- The connotation of a syntactic phrase is its meaning in context.
- The denotation of a computing device is the thing it computes.
  - the denotation of an acceptor is a language.
  - the denotation of a transducer is a function.
- The connotation of a computing device is how it behaves.
  - internal making, resource consumed etc.
***** A property of an acceptor is Denotational/stable if it refers to the language recognized and nothing else.
- This implies that acceptor recognizing the same language have all the same Denotational/stable properties. Similarly, all transducers computing the same function share the same Denotational/stable properties.
- These properties are also called semantic or extensional properties.
**** Examples of denotational/stable properties of TM
- $L(M)$ is finite or infinite.
- $L(M)$ has at least two elements.
- $L(M)$ is regular.
*** Important Theorems
**** $L$ is SD iff it has a decidable certification
***** Explanation
- Suppose acceptor $M$ recognizes $L$ and let $c \vdash w$ iff $c$ is a trace of $M$ that accepts $w$.
- Then, $\vdash$ is a certification of $L$ by definition of $L(M) = L$.
- Moreover, $\vdash$ is decidable by an algorithm that checks the trace $c$.
**** An infinite language is decidable iff it is orderly enumerated.
***** Explanation
- Suppose $L$ is OE s.t $f(0) = \text{first w accepted by M}$ and $f(n+1) = \text{first w size-lex after f(n) accepted by M}$ where $M$ is a decider.
- Then, as $f$ is non-size decreasing injection by definition and infinite which implies $f$ is total and is computable by a decider $M$ we can say that $L$ is decidable language.
**** A non-empty problem is SD iff it is finite or computably enumerated.
