post/2023-06-02-capture-001.org
***** Explanation
- If the language is finite then it is recognized by a TM?
- Suppose $L$ is an infinite recognized language, then it has a certificate $\vdash$.
- Since $\vdash$ is infinite decidable set it is orderly enumerated ($(c_1,w_1), (c_2, w_2) \cdots$) as it is decidable.
- So, $w_1, w_2 \cdot$ is a computable enumeration of $L$.
- Suppose $L$ is enumerated by a computable function $f: \mathbb{N} \rightarrow \Sigma^*$ then,  $L = L(M)$ where $M$ is an acceptor that on input $w$ calculates $f(0), f(1)\cdots$ and accepts $w$ if it is ever obtained as an output.
***** Corollary: $L$ is SD iff it has a decidable certificate.
**** If $A$ and $\bar{A}$ are T-recognizable (SD) the $A$ is decidable.
***** Intuition
- A decidable algorithm answers $\text{yes/no}$ correctly whereas a semi-decidable algorithm answers $\text{yes}$ correctly. So, decidability of $L$ is like having two semi-decidable algorithms one for $L$ and other for $\bar{L}$.
***** Proof
- Let TM $M_1$ and $M_2$ recognize $A$ and $\bar{A}$ respectively.
- Construct a TM $T$ which decides $A$.
- $T =$ on input $w$
  1. Run $M_1$ and $M_2$ on $w$ in parallel until any one accepts.
  2. If $M_1$ accepts then accept and if $M_2$ accepts then reject.
***** Corollary: $\bar{A_{TM}}$ is not T-recognizable / not SD.
As $A_{TM}$ is T-recognizable but undecidable.
**** $A$ is T-recognizable (SD) iff $A = L(E)$ for some T-enumerator E.
***** Proof
- Convert TM $M$ to equivalent enumerator $E$.
  $E =$ Simulate $M$ on each $w_i$ in $\Sigma^* = \{\epsilon, 0, 1, 00, 01 ...\}$.
  If M accepts $w_i$ then print $w_i$ and continue.
  If $M$ on $w_i$ loops then simulate $M$ on $w_1, w_2...w_i$ for $i = 1, 2, ...n$ and print those $w_i$ if accepted.
**** $A_{DFA}$ is decidable.
***** Proof
- Let $A_{DFA} = \{<B,w>\}$ s.t $B$ is a DFA and accepts $w$.
- $D_{A_{DFA}} =$ "On input s,
  1. Check that $s$ is of the correct form.
  2. Simulate the computation of $B$ on $w$.
  3. If $B$ ends in an accept state then accept, if not then reject.
- Similarly, $A_{NFA}$ is also decidable as we can have our first step to convert $B$ to equivalent DFA.
**** $E_{DFA}$ is decidable.
***** Proof
- Let $E_{DFA} = \{<B>\}$ s.t $B$ is a DFA and $L(B) = \phi$ and let TM $D_{E_{DFA}}$ be the decider s.t,
- $D_{E_{DFA}} =$ On input $<B>$,
  1. Marks the start state.
  2. Repeats until no new state is marked.
     1. Mark every state with incoming arrow from previous marked state.
  3. Accept if no accept state has been marked and reject if any accept state has been marked.
**** $A_{CFG}$ is decidable.
***** Proof
- Let $A_{CFG} = \{<G,w>\}$ s.t $G$ is a CFG and $w \in L(G)$ and let $D_{A_{CFG}}$ be its Turing decider.
- $D_{A_{CFG}} =$ on input $<G,w>$,
  1. Convert $G$ to CNF.
  2. Try all possible derivations of length $2|w|-1$.
  3. Accept if any generate $w$ else reject.
**** $E_{CFG}$ is decidable.
***** Proof
- Let $E_{CFG} = \{<B>\}$ s.t $B$ is a CFG and $L(B) = \phi$ and let TM $D_{E_{CFG}}$ be the decider s.t,
- $D_{E_{CFG}} =$ On input $<G>$,
  1. Marks all occurrences of terminals in $G$.
  2. Repeats until no new non-terminal is marked.
     1. Mark all occurrences of $A$ when $A \rightarrow B_1B_2..B_k$ is a rule where all $B_i$'s are already marked.
  3. Accept if start nonterminal is marked and reject if not.
**** $EQ_{CFG}$ is undecidable.
***** Proof
-

**** $A_{TM}$ is undecidable.
***** Proof by Contradiction
- Let $A_{TM} = \{<M,w>\}$ s.t $M$ is a $TM$ and $M$ accepts $w$.
- Assume some TM $H$ decides $A_{TM}$ then,
  - $H$ on $<M,w>$ accepts iff $M$ accepts $w$ and rejects iff $M$ rejects $w$.
- Use $H$ to construct a TM $D$ s.t,
  - $D$ on input $<M>$,
    1. Simulate $H$ on input $<M,<M>>$.
    2. Accept if $H$ rejects and reject if $H$ accepts.
- This implies that,
  - $D$ accepts $<M>$ iff $M$ doesn't accept $<M>$.
  - $D$ accepts $<D>$ iff $<D>$ doesn't accept $D$ (if we replace $<M>$ to $<D>$).
- Contradiction. QED.
**** Proofs using reductions
We use our fact that $A_{TM}$ is undecidable to show other problems are undecidable.
***** If functions $f,g : \ \Sigma^* \ \rightarrow \Sigma^*$ are computable then so is $f \circ g$.
- The output of $f$ is fed to $g$ as input.
***** If $\rho: \ P \preccurlyeq_{c} Q$ and $\rho^{'}: \ Q \preccurlyeq_{c} R$ then $\rho \circ \rho^{'} : \ P \preccurlyeq_{c} R$.
****** Proof
- As composition is computable then so is $\rho \circ \rho^{'}$.
- It is also a reduction as,
  - $x \in P$
    - iff $\rho(x) \in Q$
    - iff $\rho^{'}(\rho(x)) \in R$
***** Reductions preserve decidability and SD
- When $\rho: \ P \preccurlyeq Q$ then,
  - If $Q$ is decidable then so is $P$.
  - If $Q$ is SD then so is $P$.
****** Mapping Reductions
******* If $A \le_{m} B$ and $B$ is decidable the so is $A$
******** Proof
- Assume TM $R$ decides $B$ then we can construct a TM $S$ s.t,
  - $S =$ on input $w$
    1. Compute $f(w)$.
    2. Run $R$ on $f(w)$ to test if $f(w) \in B$.
    3. If $R$ halts then result of $R$ is our result.
********* Corollary: If $A \le_{m} B$ and $A$ is undecidable then so is $B$.
****** If $A \le_{m} B$ and $B$ is T-recognizable (SD) the so is $A$.
******* Corollary: If $A \le_{m} B$ and $B$ is not T-recognizable (SD) then $A$ is not SD either.
***** $HALT_{TM}$ is undecidable.
****** Proof
- Let $HALT_{TM} = \{<M,w>\}$ s.t $M$ halts on input $w$.
- Let $R$ be the decider for $HALT_{TM}$ and $S$ be a decider s.t,
  - $S =$ on input $<M,w>$,
    1. Use $R$ to test if $M$ halts on $w$ and reject if it does not.
    2. Simulate $M$ on $w$ until it halts.
    3. If $M$ accepts then accepts and reject otherwise.
- As shown above if $R$ exists then we can decide $A_{TM}$ which is not possible. QED.
***** $E_{TM}$ is undecidable
- This problem is not even SD because its compliment is.
****** Proof
- Let $E_{TM} = <M>$ s.t $M$ is a TM and $L(M) = \phi$.
- Let $R$ be the decider for $E_{TM}$ then we can construct a TM $S$ s.t,
  - $S =$ on input $<M,w>$,
    1. Transform $M$ to new $M_w$ which works like $M$ except the it always rejects strings $x$ if $x \not{=} w$.
       - So, $L(M_w) = \begin{cases} \{w\} & \text{if M accepts w}\\ \phi & \text{if M rejects w} \end{cases}$
    2. Use $R$ to test if $L(M_w) = \phi$.
    3. If $M$ rejects $w$ then reject else if $M$ accepts $w$ then accept.
- As, $R$ can decide $A_{TM}$ which is undecidable we have a contradiction. QED.
***** $\bar{E_{TM}}$ is undecidable
**** Denotational/stable Properties
***** Rice's Theorem: Every denotational/stable property of Turing-acceptor is undecidable.
