content/posts/2023-06-02-capture-001.md


###### Explanation {#explanation}

-   If the language is finite then it is recognized by a TM?
-   Suppose \\(L\\) is an infinite recognized language, then it has a certificate \\(\vdash\\).
-   Since \\(\vdash\\) is infinite decidable set it is orderly enumerated (\\((c\_1,w\_1), (c\_2, w\_2) \cdots\\)) as it is decidable.
-   So, \\(w\_1, w\_2 \cdot\\) is a computable enumeration of \\(L\\).
-   Suppose \\(L\\) is enumerated by a computable function \\(f: \mathbb{N} \rightarrow \Sigma^\*\\) then,  \\(L = L(M)\\) where \\(M\\) is an acceptor that on input \\(w\\) calculates \\(f(0), f(1)\cdots\\) and accepts \\(w\\) if it is ever obtained as an output.


###### Corollary: \\(L\\) is SD iff it has a decidable certificate. {#corollary-l-is-sd-iff-it-has-a-decidable-certificate-dot}


##### If \\(A\\) and \\(\bar{A}\\) are T-recognizable (SD) the \\(A\\) is decidable. {#if-a-and-bar-a-are-t-recognizable--sd--the-a-is-decidable-dot}


###### Intuition {#intuition}

-   A decidable algorithm answers \\(\text{yes/no}\\) correctly whereas a semi-decidable algorithm answers \\(\text{yes}\\) correctly. So, decidability of \\(L\\) is like having two semi-decidable algorithms one for \\(L\\) and other for \\(\bar{L}\\).


###### Proof {#proof}

-   Let TM \\(M\_1\\) and \\(M\_2\\) recognize \\(A\\) and \\(\bar{A}\\) respectively.
-   Construct a TM \\(T\\) which decides \\(A\\).
-   \\(T =\\) on input \\(w\\)
    1.  Run \\(M\_1\\) and \\(M\_2\\) on \\(w\\) in parallel until any one accepts.
    2.  If \\(M\_1\\) accepts then accept and if \\(M\_2\\) accepts then reject.


###### Corollary: \\(\bar{A\_{TM}}\\) is not T-recognizable / not SD. {#corollary-bar-a-tm-is-not-t-recognizable-not-sd-dot}

As \\(A\_{TM}\\) is T-recognizable but undecidable.


##### \\(A\\) is T-recognizable (SD) iff \\(A = L(E)\\) for some T-enumerator E. {#a-is-t-recognizable--sd--iff-a-l--e--for-some-t-enumerator-e-dot}


###### Proof {#proof}

-   Convert TM \\(M\\) to equivalent enumerator \\(E\\).
    \\(E =\\) Simulate \\(M\\) on each \\(w\_i\\) in \\(\Sigma^\* = \\{\epsilon, 0, 1, 00, 01 ...\\}\\).
    If M accepts \\(w\_i\\) then print \\(w\_i\\) and continue.
    If \\(M\\) on \\(w\_i\\) loops then simulate \\(M\\) on \\(w\_1, w\_2...w\_i\\) for \\(i = 1, 2, ...n\\) and print those \\(w\_i\\) if accepted.


##### \\(A\_{DFA}\\) is decidable. {#a-dfa-is-decidable-dot}


###### Proof {#proof}

-   Let \\(A\_{DFA} = \\{<B,w>\\}\\) s.t \\(B\\) is a DFA and accepts \\(w\\).
-   \\(D\_{A\_{DFA}} =\\) "On input s,
    1.  Check that \\(s\\) is of the correct form.
    2.  Simulate the computation of \\(B\\) on \\(w\\).
    3.  If \\(B\\) ends in an accept state then accept, if not then reject.
-   Similarly, \\(A\_{NFA}\\) is also decidable as we can have our first step to convert \\(B\\) to equivalent DFA.


##### \\(E\_{DFA}\\) is decidable. {#e-dfa-is-decidable-dot}


###### Proof {#proof}

-   Let \\(E\_{DFA} = \\{<B>\\}\\) s.t \\(B\\) is a DFA and \\(L(B) = \phi\\) and let TM \\(D\_{E\_{DFA}}\\) be the decider s.t,
-   \\(D\_{E\_{DFA}} =\\) On input \\(<B>\\),
    1.  Marks the start state.
    2.  Repeats until no new state is marked.
        1.  Mark every state with incoming arrow from previous marked state.
    3.  Accept if no accept state has been marked and reject if any accept state has been marked.


##### \\(A\_{CFG}\\) is decidable. {#a-cfg-is-decidable-dot}


###### Proof {#proof}

-   Let \\(A\_{CFG} = \\{<G,w>\\}\\) s.t \\(G\\) is a CFG and \\(w \in L(G)\\) and let \\(D\_{A\_{CFG}}\\) be its Turing decider.
-   \\(D\_{A\_{CFG}} =\\) on input \\(<G,w>\\),
    1.  Convert \\(G\\) to CNF.
    2.  Try all possible derivations of length \\(2|w|-1\\).
    3.  Accept if any generate \\(w\\) else reject.


##### \\(E\_{CFG}\\) is decidable. {#e-cfg-is-decidable-dot}


###### Proof {#proof}

-   Let \\(E\_{CFG} = \\{<B>\\}\\) s.t \\(B\\) is a CFG and \\(L(B) = \phi\\) and let TM \\(D\_{E\_{CFG}}\\) be the decider s.t,
-   \\(D\_{E\_{CFG}} =\\) On input \\(<G>\\),
    1.  Marks all occurrences of terminals in \\(G\\).
    2.  Repeats until no new non-terminal is marked.
        1.  Mark all occurrences of \\(A\\) when \\(A \rightarrow B\_1B\_2..B\_k\\) is a rule where all \\(B\_i\\)'s are already marked.
    3.  Accept if start nonterminal is marked and reject if not.


##### \\(EQ\_{CFG}\\) is undecidable. {#eq-cfg-is-undecidable-dot}


###### Proof {#proof}

-


##### \\(A\_{TM}\\) is undecidable. {#a-tm-is-undecidable-dot}


###### Proof by Contradiction {#proof-by-contradiction}

-   Let \\(A\_{TM} = \\{<M,w>\\}\\) s.t \\(M\\) is a \\(TM\\) and \\(M\\) accepts \\(w\\).
-   Assume some TM \\(H\\) decides \\(A\_{TM}\\) then,
    -   \\(H\\) on \\(<M,w>\\) accepts iff \\(M\\) accepts \\(w\\) and rejects iff \\(M\\) rejects \\(w\\).
-   Use \\(H\\) to construct a TM \\(D\\) s.t,
    -   \\(D\\) on input \\(<M>\\),
        1.  Simulate \\(H\\) on input \\(<M,<M>>\\).
        2.  Accept if \\(H\\) rejects and reject if \\(H\\) accepts.
-   This implies that,
    -   \\(D\\) accepts \\(<M>\\) iff \\(M\\) doesn't accept \\(<M>\\).
    -   \\(D\\) accepts \\(<D>\\) iff \\(<D>\\) doesn't accept \\(D\\) (if we replace \\(<M>\\) to \\(<D>\\)).
-   Contradiction. QED.


##### Proofs using reductions {#proofs-using-reductions}

We use our fact that \\(A\_{TM}\\) is undecidable to show other problems are undecidable.


###### If functions \\(f,g : \ \Sigma^\* \ \rightarrow \Sigma^\*\\) are computable then so is \\(f \circ g\\). {#if-functions-f-g-sigma-rightarrow-sigma-are-computable-then-so-is-f-circ-g-dot}

-   The output of \\(f\\) is fed to \\(g\\) as input.


###### If \\(\rho: \ P \preccurlyeq\_{c} Q\\) and \\(\rho^{'}: \ Q \preccurlyeq\_{c} R\\) then \\(\rho \circ \rho^{'} : \ P \preccurlyeq\_{c} R\\). {#if-rho-p-preccurlyeq-c-q-and-rho-q-preccurlyeq-c-r-then-rho-circ-rho-p-preccurlyeq-c-r-dot}

<!--list-separator-->

-  Proof

    -   As composition is computable then so is \\(\rho \circ \rho^{'}\\).
    -   It is also a reduction as,
        -   \\(x \in P\\)
            -   iff \\(\rho(x) \in Q\\)
            -   iff \\(\rho^{'}(\rho(x)) \in R\\)


###### Reductions preserve decidability and SD {#reductions-preserve-decidability-and-sd}

-   When \\(\rho: \ P \preccurlyeq Q\\) then,
    -   If \\(Q\\) is decidable then so is \\(P\\).
    -   If \\(Q\\) is SD then so is \\(P\\).

<!--list-separator-->

-  Mapping Reductions

    <!--list-separator-->

    -  If \\(A \le\_{m} B\\) and \\(B\\) is decidable the so is \\(A\\)

        <!--list-separator-->

        -  Proof

            -   Assume TM \\(R\\) decides \\(B\\) then we can construct a TM \\(S\\) s.t,
                -   \\(S =\\) on input \\(w\\)
                    1.  Compute \\(f(w)\\).
                    2.  Run \\(R\\) on \\(f(w)\\) to test if \\(f(w) \in B\\).
                    3.  If \\(R\\) halts then result of \\(R\\) is our result.

            <!--list-separator-->

            -  Corollary: If \\(A \le\_{m} B\\) and \\(A\\) is undecidable then so is \\(B\\).

<!--list-separator-->

-  If \\(A \le\_{m} B\\) and \\(B\\) is T-recognizable (SD) the so is \\(A\\).

    <!--list-separator-->

    -  Corollary: If \\(A \le\_{m} B\\) and \\(B\\) is not T-recognizable (SD) then \\(A\\) is not SD either.


###### \\(HALT\_{TM}\\) is undecidable. {#halt-tm-is-undecidable-dot}

<!--list-separator-->

-  Proof

    -   Let \\(HALT\_{TM} = \\{<M,w>\\}\\) s.t \\(M\\) halts on input \\(w\\).
    -   Let \\(R\\) be the decider for \\(HALT\_{TM}\\) and \\(S\\) be a decider s.t,
        -   \\(S =\\) on input \\(<M,w>\\),
            1.  Use \\(R\\) to test if \\(M\\) halts on \\(w\\) and reject if it does not.
            2.  Simulate \\(M\\) on \\(w\\) until it halts.
            3.  If \\(M\\) accepts then accepts and reject otherwise.
    -   As shown above if \\(R\\) exists then we can decide \\(A\_{TM}\\) which is not possible. QED.


###### \\(E\_{TM}\\) is undecidable {#e-tm-is-undecidable}

-   This problem is not even SD because its compliment is.

<!--list-separator-->

-  Proof

    -   Let \\(E\_{TM} = <M>\\) s.t \\(M\\) is a TM and \\(L(M) = \phi\\).
    -   Let \\(R\\) be the decider for \\(E\_{TM}\\) then we can construct a TM \\(S\\) s.t,
        -   \\(S =\\) on input \\(<M,w>\\),
            1.  Transform \\(M\\) to new \\(M\_w\\) which works like \\(M\\) except the it always rejects strings \\(x\\) if \\(x \not{=} w\\).
                -   So, \\(L(M\_w) = \begin{cases} \\{w\\} & \text{if M accepts w}\\\ \phi & \text{if M rejects w} \end{cases}\\)
            2.  Use \\(R\\) to test if \\(L(M\_w) = \phi\\).
            3.  If \\(M\\) rejects \\(w\\) then reject else if \\(M\\) accepts \\(w\\) then accept.
    -   As, \\(R\\) can decide \\(A\_{TM}\\) which is undecidable we have a contradiction. QED.


###### \\(\bar{E\_{TM}}\\) is undecidable {#bar-e-tm-is-undecidable}


##### Denotational/stable Properties {#denotational-stable-properties}


###### Rice's Theorem: Every denotational/stable property of Turing-acceptor is undecidable. {#rice-s-theorem-every-denotational-stable-property-of-turing-acceptor-is-undecidable-dot}

<!--list-separator-->

-  Proof
