post/2023-06-02-capture-001.org
****** Proof
- Assume two acceptors $E$ and $A$ such that and here trivial means either yes or no and non-trivial means sometimes yes and sometimes no,
  - $L(E) = \phi$, $E$ recognizes $\phi$.
  - $E \notin P$ (it won't matter).
  - $P$ is not trivial and $A \in P$.
- So, deciding $P$ does two things,
  - It allows us to distinguish $E$ from $A$ as one accepts $\phi$ and other does not.
  - It allows us to distinguish whether a Turing machine $M$ accepts or does not accept $\epsilon$.
- We can construct a reduction, $\rho: \ \epsilon-\text{ACCEPT} \preccurlyeq_{c} P$,
  - Given $M$ build a new acceptor $M^{'}$ s.t $M^{'} = \rho(M)$
  - On input $x$, $M^{'}$ disregards $x$ and runs $M$ on $\epsilon$.
  - If $M$ accepts $\epsilon$ then $M^{'}$ runs $A$ on $x$. If $M$ does not then disregard everything, do nothing.
  - So we have,  $L(M^{'}) = \begin{cases} L(A) & \text{if M accepts } \epsilon \\ \phi = L(E) & \text{if M does not accept } \epsilon \end{cases}$.
  - So, $M$ accepts $\epsilon$ if $M^{'} = \rho(M) \in P$ i.e if $M^{'}$ has property $P$.
  - As we know that $\epsilon-\text{ACCEPT}$ is undecidable we can say that every non trivial denotational/stable property is undecidable or no denotational/stable property is decidable unless trivial.
*** Summary
| Semi-decidable          | Decidable            |
|-------------------------+----------------------|
| $L$ recognized by TA    | $L$ recognized by TD |
| CE                      | OE                   |
| $L$ has a certification | $L$ $\bar{L}$ are SD |
**** How to prove a problem $P$ is decidable?
- $P$ is recognized by a decider.
- $P$ is finite or orderly enumerated.
- Both $P$ and $\bar{P}$ are SD.
- $P$ is definable using union, intersection and compliment (or difference) from decidable problems.
**** How to prove a problem $Q$ is SD?
- $Q$ is recognized by an acceptor/recognizer.
- $Q$ is computably enumerated.
- $Q$ has a decidable certification.
- $Q$ is defined using union, intersection from SD languages.

*** Closure Properties
**** Decidable Problems
- Let $P$ and $Q$ be decision problems (decidable languages) referring to the same instances (maybe strings or graphs) and suppose we have algorithms $A_P$ and $A_Q$ that decide $P$ and $Q$ respectively.
***** The complement of $P$ i.e $\bar{P}$ is decidable.
****** Proof
- To decide if some input $w \in \bar{P}$,
  - Run $A_P$ on input $w$ and do the opposite of what $A_P$ outputs, i.e reject if accept and accept if reject.
***** The intersection of $P$ and $Q$ is decidable.
****** Proof
- So, intersection is basically like an $AND$. To decide if some input $w \in P \cap Q$,
  - First, run $A_P$ on $w$ if it rejects then reject immediately else if it accepts run $A_Q$ on $w$ if it rejects then reject and if it accepts then accept.
***** The union of $P$ and $Q$ is decidable.
****** Proof
- So, union is basically like an $OR$. So, to decide if some input $w \in P \cup Q$,
  - Run $A_P$ on $w$ and accept if accepts else if it rejects run $A_Q$ on $w$ and accept if it accepts and reject if it rejects.
***** The concatenation of $P$ and $Q$ is decidable
****** Proof
- Let $P$ and $Q$ be languages. A string $w$ is in the concatenation of $P$ and $Q$ if you can write it as $w=ab$, where
  $a \in P$ and $b\in Q$. This means that you can split $w$ into two halves. The first half is a string from $P$ and the second half is a
  string from $Q$. If you have two decidable languages $P$ and $Q$, you can make a decider for $P$ concatenated with $Q$ as follows:
  + Given a two-tape nondeterministic Turing machine,
    1. Non-deterministically guess where to split the string into two parts $w=ab$
    2. Run the first machine to make sure the first half is in $P$
    3. If it isn't, reject.
    4. Run the second machine to make sure the second half is in $Q$
    5. If it isn't, reject.
  + If the string really is in the concatenation of $P$ and $Q$, then one of these guesses will be correct; that nondeterministic branch will accept, so the computation itself accepts.
***** The kleene star of decidable language $P$ i.e $P^*$ is decidable
**** Semi-decidable Problems
- We cannon run Turing machines sequentially as we did for decidable languages here because the first can go into loop never reaching the next steps in the sequence.
- Suppose $L_0, L_1 \subseteq \Sigma^*$ are semi-decidable i.e they have certifications $\vdash_{0}$, $\vdash_{1}$ respectively.
***** The union of two SD languages is SD.
****** Proof using certifications
- Let $c \vdash x$ then we can say that $\vdash$ is decidable as it is union of two decidable sets i.e $c \vdash_{0} x \ \text{OR} \ c \vdash_{1} x$ ,
- $\vdash$ is a certification because,
  - $x \in L_0 \cup L_1$
    - iff $x \in L_0$ OR $x \in L_1$
    - iff for some $c$, $c \vdash_{0} x$ or $c \vdash_{i} x$.
    - iff $c \vdash x$ for some $c$. (from defn of $\vdash$)
****** Proof using TM
- Let $M_0$ and $M_1$ be T-recognizers for $L_0$ and $L_1$ respectively.
- We can run $M_0$ and $M_1$ simultaneously i.e one step of $M_0$ followed by one step of $M_1$ and accept when any one of them accepts and reject otherwise.
***** The intersection of two SD languages is SD
****** Proof using certifications
- Define $c \vdash x$ to hold iff $c$ is $<c_0,c_1>$ where $c_0 \vdash_{0} x$ AND $c_1 \vdash_{1} x$.
- $\vdash$ is decidable because $\vdash_{0}$ and $\vdash_{1}$ are decidable.
- It is a certification because,
  - $x \in L_0 \cap L_1$
    - iff $x \in L_0$ AND $x \in L_1$
    - iff for some $c_0, c_1$, $c_0 \vdash_{0} x$ or $c_1 \vdash_{1} x$.
    - iff $c \vdash x$ for some $c$. (from defn of $\vdash$)
***** The complement of a SD language need not be SD
- As if it were then every semi-decidable language would be decidable as per this [[*If $A$ and $\bar{A}$ are T-recognizable (SD) the $A$ is decidable.][theorem]] .
**** Undecidable Problems
***** Collection of undecidable problems/languages is *not* closed under union, intersection, concatenation, compliment, kleene star so not closed under anything.
*** Problems
