content/posts/2023-06-02-capture-001.md

    -   Assume two acceptors \\(E\\) and \\(A\\) such that and here trivial means either yes or no and non-trivial means sometimes yes and sometimes no,
        -   \\(L(E) = \phi\\), \\(E\\) recognizes \\(\phi\\).
        -   \\(E \notin P\\) (it won't matter).
        -   \\(P\\) is not trivial and \\(A \in P\\).
    -   So, deciding \\(P\\) does two things,
        -   It allows us to distinguish \\(E\\) from \\(A\\) as one accepts \\(\phi\\) and other does not.
        -   It allows us to distinguish whether a Turing machine \\(M\\) accepts or does not accept \\(\epsilon\\).
    -   We can construct a reduction, \\(\rho: \ \epsilon-\text{ACCEPT} \preccurlyeq\_{c} P\\),
        -   Given \\(M\\) build a new acceptor \\(M^{'}\\) s.t \\(M^{'} = \rho(M)\\)
        -   On input \\(x\\), \\(M^{'}\\) disregards \\(x\\) and runs \\(M\\) on \\(\epsilon\\).
        -   If \\(M\\) accepts \\(\epsilon\\) then \\(M^{'}\\) runs \\(A\\) on \\(x\\). If \\(M\\) does not then disregard everything, do nothing.
        -   So we have,  \\(L(M^{'}) = \begin{cases} L(A) & \text{if M accepts } \epsilon \\\ \phi = L(E) & \text{if M does not accept } \epsilon \end{cases}\\).
        -   So, \\(M\\) accepts \\(\epsilon\\) if \\(M^{'} = \rho(M) \in P\\) i.e if \\(M^{'}\\) has property \\(P\\).
        -   As we know that \\(\epsilon-\text{ACCEPT}\\) is undecidable we can say that every non trivial denotational/stable property is undecidable or no denotational/stable property is decidable unless trivial.


#### Summary {#summary}

| Semi-decidable              | Decidable                    |
|-----------------------------|------------------------------|
| \\(L\\) recognized by TA    | \\(L\\) recognized by TD     |
| CE                          | OE                           |
| \\(L\\) has a certification | \\(L\\) \\(\bar{L}\\) are SD |


##### How to prove a problem \\(P\\) is decidable? {#how-to-prove-a-problem-p-is-decidable}

-   \\(P\\) is recognized by a decider.
-   \\(P\\) is finite or orderly enumerated.
-   Both \\(P\\) and \\(\bar{P}\\) are SD.
-   \\(P\\) is definable using union, intersection and compliment (or difference) from decidable problems.


##### How to prove a problem \\(Q\\) is SD? {#how-to-prove-a-problem-q-is-sd}

-   \\(Q\\) is recognized by an acceptor/recognizer.
-   \\(Q\\) is computably enumerated.
-   \\(Q\\) has a decidable certification.
-   \\(Q\\) is defined using union, intersection from SD languages.


#### Closure Properties {#closure-properties}


##### Decidable Problems {#decidable-problems}

-   Let \\(P\\) and \\(Q\\) be decision problems (decidable languages) referring to the same instances (maybe strings or graphs) and suppose we have algorithms \\(A\_P\\) and \\(A\_Q\\) that decide \\(P\\) and \\(Q\\) respectively.


###### The complement of \\(P\\) i.e \\(\bar{P}\\) is decidable. {#the-complement-of-p-i-dot-e-bar-p-is-decidable-dot}

<!--list-separator-->

-  Proof

    -   To decide if some input \\(w \in \bar{P}\\),
        -   Run \\(A\_P\\) on input \\(w\\) and do the opposite of what \\(A\_P\\) outputs, i.e reject if accept and accept if reject.


###### The intersection of \\(P\\) and \\(Q\\) is decidable. {#the-intersection-of-p-and-q-is-decidable-dot}

<!--list-separator-->

-  Proof

    -   So, intersection is basically like an \\(AND\\). To decide if some input \\(w \in P \cap Q\\),
        -   First, run \\(A\_P\\) on \\(w\\) if it rejects then reject immediately else if it accepts run \\(A\_Q\\) on \\(w\\) if it rejects then reject and if it accepts then accept.


###### The union of \\(P\\) and \\(Q\\) is decidable. {#the-union-of-p-and-q-is-decidable-dot}

<!--list-separator-->

-  Proof

    -   So, union is basically like an \\(OR\\). So, to decide if some input \\(w \in P \cup Q\\),
        -   Run \\(A\_P\\) on \\(w\\) and accept if accepts else if it rejects run \\(A\_Q\\) on \\(w\\) and accept if it accepts and reject if it rejects.


###### The concatenation of \\(P\\) and \\(Q\\) is decidable {#the-concatenation-of-p-and-q-is-decidable}

<!--list-separator-->

-  Proof

    -   Let \\(P\\) and \\(Q\\) be languages. A string \\(w\\) is in the concatenation of \\(P\\) and \\(Q\\) if you can write it as \\(w=ab\\), where
        \\(a \in P\\) and \\(b\in Q\\). This means that you can split \\(w\\) into two halves. The first half is a string from \\(P\\) and the second half is a
        string from \\(Q\\). If you have two decidable languages \\(P\\) and \\(Q\\), you can make a decider for \\(P\\) concatenated with \\(Q\\) as follows:
        -   Given a two-tape nondeterministic Turing machine,
            1.  Non-deterministically guess where to split the string into two parts \\(w=ab\\)
            2.  Run the first machine to make sure the first half is in \\(P\\)
            3.  If it isn't, reject.
            4.  Run the second machine to make sure the second half is in \\(Q\\)
            5.  If it isn't, reject.
        -   If the string really is in the concatenation of \\(P\\) and \\(Q\\), then one of these guesses will be correct; that nondeterministic branch will accept, so the computation itself accepts.


###### The kleene star of decidable language \\(P\\) i.e \\(P^\*\\) is decidable {#the-kleene-star-of-decidable-language-p-i-dot-e-p-is-decidable}


##### Semi-decidable Problems {#semi-decidable-problems}

-   We cannon run Turing machines sequentially as we did for decidable languages here because the first can go into loop never reaching the next steps in the sequence.
-   Suppose \\(L\_0, L\_1 \subseteq \Sigma^\*\\) are semi-decidable i.e they have certifications \\(\vdash\_{0}\\), \\(\vdash\_{1}\\) respectively.


###### The union of two SD languages is SD. {#the-union-of-two-sd-languages-is-sd-dot}

<!--list-separator-->

-  Proof using certifications

    -   Let \\(c \vdash x\\) then we can say that \\(\vdash\\) is decidable as it is union of two decidable sets i.e \\(c \vdash\_{0} x \ \text{OR} \ c \vdash\_{1} x\\) ,
    -   \\(\vdash\\) is a certification because,
        -   \\(x \in L\_0 \cup L\_1\\)
            -   iff \\(x \in L\_0\\) OR \\(x \in L\_1\\)
            -   iff for some \\(c\\), \\(c \vdash\_{0} x\\) or \\(c \vdash\_{i} x\\).
            -   iff \\(c \vdash x\\) for some \\(c\\). (from defn of \\(\vdash\\))

<!--list-separator-->

-  Proof using TM

    -   Let \\(M\_0\\) and \\(M\_1\\) be T-recognizers for \\(L\_0\\) and \\(L\_1\\) respectively.
    -   We can run \\(M\_0\\) and \\(M\_1\\) simultaneously i.e one step of \\(M\_0\\) followed by one step of \\(M\_1\\) and accept when any one of them accepts and reject otherwise.


###### The intersection of two SD languages is SD {#the-intersection-of-two-sd-languages-is-sd}

<!--list-separator-->

-  Proof using certifications

    -   Define \\(c \vdash x\\) to hold iff \\(c\\) is \\(<c\_0,c\_1>\\) where \\(c\_0 \vdash\_{0} x\\) AND \\(c\_1 \vdash\_{1} x\\).
    -   \\(\vdash\\) is decidable because \\(\vdash\_{0}\\) and \\(\vdash\_{1}\\) are decidable.
    -   It is a certification because,
        -   \\(x \in L\_0 \cap L\_1\\)
            -   iff \\(x \in L\_0\\) AND \\(x \in L\_1\\)
            -   iff for some \\(c\_0, c\_1\\), \\(c\_0 \vdash\_{0} x\\) or \\(c\_1 \vdash\_{1} x\\).
            -   iff \\(c \vdash x\\) for some \\(c\\). (from defn of \\(\vdash\\))


###### The complement of a SD language need not be SD {#the-complement-of-a-sd-language-need-not-be-sd}

-   As if it were then every semi-decidable language would be decidable as per this [theorem](#if-a-and-bar-a-are-t-recognizable--sd--the-a-is-decidable-dot) .


##### Undecidable Problems {#undecidable-problems}


###### Collection of undecidable problems/languages is **not** closed under union, intersection, concatenation, compliment, kleene star so not closed under anything. {#collection-of-undecidable-problems-languages-is-not-closed-under-union-intersection-concatenation-compliment-kleene-star-so-not-closed-under-anything-dot}
