content/posts/2023-06-02-capture-001.md


#### Problems {#problems}


##### If \\(D\\) is decidable and \\(U\\) is undecidable {#if-d-is-decidable-and-u-is-undecidable}

-   \\(D \cap U\\): This language is the intersection of \\(D\\) and \\(U\\), which contains all strings that belong to both \\(D\\) and \\(U\\). Since \\(U\\) is undecidable, this language is also undecidable.
-   \\(D \cup U\\): This language is the union of \\(D\\) and \\(U\\), which contains all strings that belong to either \\(D\\) or \\(U\\). Since \\(D\\) is decidable, this language is also decidable.
-   \\(D - U\\): This language is the set difference of \\(D\\) and \\(U\\), which contains all strings that belong to \\(D\\) but not \\(U\\). Since \\(D\\) is decidable, this language is also decidable.
-   \\(U - D\\): This language is the set difference of \\(U\\) and \\(D\\), which contains all strings that belong to \\(U\\) but not \\(D\\). Since \\(U\\) is undecidable, this language is also undecidable.
-   \\(D \cdot U\\): This language is the concatenation of \\(D\\) and \\(U\\), which contains all strings that can be formed by concatenating a string from \\(D\\) with a string from \\(U\\). Since \\(U\\) is undecidable, this language is also undecidable.


###### \\(D\\) is a decidable language, and \\(U\\) is undecidable and disjoint from \\(D\\) then \\(D \cup U\\) {#d-is-a-decidable-language-and-u-is-undecidable-and-disjoint-from-d-then-d-cup-u}

-   If \\(D\\) is a decidable language and \\(U\\) is an undecidable language that is disjoint from \\(D\\)
    (i.e., no string belongs to both \\(D\\) and \\(U\\)), then we can conclude that the language \\(D \cup U\\) is decidable.
    This is because the language \\(D \cup U\\) contains all strings that belong to either \\(D\\) or \\(U\\), and since \\(D\\) is
    decidable, we can use a decider for \\(D\\) to determine whether a given string belongs to \\(D \cup U\\). Therefore, the language \\(D \cup U\\) is decidable.
